OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic16/pic18lf4331.h
extern __at(0x0F95) __sfr TRISD;

typedef union
  {
  struct
    {
    unsigned TRISD0             : 1;
    unsigned TRISD1             : 1;
    unsigned TRISD2             : 1;
    unsigned TRISD3             : 1;
    unsigned TRISD4             : 1;
    unsigned TRISD5             : 1;
    unsigned TRISD6             : 1;
    unsigned TRISD7             : 1;
    };

  struct
    {
    unsigned RD0                : 1;
    unsigned RD1                : 1;
    unsigned RD2                : 1;
    unsigned RD3                : 1;
    unsigned RD4                : 1;
    unsigned RD5                : 1;
    unsigned RD6                : 1;
    unsigned RD7                : 1;
    };
  } __TRISDbits_t;

extern __at(0x0F95) volatile __TRISDbits_t TRISDbits;

#define _TRISD_TRISD0           0x01
#define _TRISD_RD0              0x01
#define _TRISD_TRISD1           0x02
#define _TRISD_RD1              0x02
#define _TRISD_TRISD2           0x04
#define _TRISD_RD2              0x04
#define _TRISD_TRISD3           0x08
#define _TRISD_RD3              0x08
#define _TRISD_TRISD4           0x10
#define _TRISD_RD4              0x10
#define _TRISD_TRISD5           0x20
#define _TRISD_RD5              0x20
#define _TRISD_TRISD6           0x40
#define _TRISD_RD6              0x40
#define _TRISD_TRISD7           0x80
#define _TRISD_RD7              0x80

//==============================================================================


//==============================================================================
//        DDRE Bits

extern __at(0x0F96) __sfr DDRE;

typedef union
  {
  struct
    {
    unsigned TRISE0             : 1;
    unsigned TRISE1             : 1;
    unsigned TRISE2             : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned RE0                : 1;
    unsigned RE1                : 1;
    unsigned RE2                : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned RE                 : 3;
    unsigned                    : 5;
    };

  struct
    {
    unsigned TRISE              : 3;
    unsigned                    : 5;
    };
  } __DDREbits_t;

extern __at(0x0F96) volatile __DDREbits_t DDREbits;

#define _TRISE0                 0x01
#define _RE0                    0x01
#define _TRISE1                 0x02
#define _RE1                    0x02
#define _TRISE2                 0x04
#define _RE2                    0x04

//==============================================================================


//==============================================================================
//        TRISE Bits

extern __at(0x0F96) __sfr TRISE;

typedef union
  {
  struct
    {
    unsigned TRISE0             : 1;
    unsigned TRISE1             : 1;
    unsigned TRISE2             : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned RE0                : 1;
    unsigned RE1                : 1;
    unsigned RE2                : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned RE                 : 3;
    unsigned                    : 5;
    };

  struct
    {
    unsigned TRISE              : 3;
    unsigned                    : 5;
    };
  } __TRISEbits_t;

extern __at(0x0F96) volatile __TRISEbits_t TRISEbits;

#define _TRISE_TRISE0           0x01
#define _TRISE_RE0              0x01
#define _TRISE_TRISE1           0x02
#define _TRISE_RE1              0x02
#define _TRISE_TRISE2           0x04
#define _TRISE_RE2              0x04

//==============================================================================


//==============================================================================
//        ADCHS Bits

extern __at(0x0F99) __sfr ADCHS;

typedef union
  {
  struct
    {
    unsigned GASEL0             : 1;
    unsigned GASEL1             : 1;
    unsigned GCSEL0             : 1;
    unsigned GCSEL1             : 1;
    unsigned GBSEL0             : 1;
    unsigned GBSEL1             : 1;
    unsigned GDSEL0             : 1;
    unsigned GDSEL1             : 1;
    };

  struct
    {
    unsigned SASEL0             : 1;
    unsigned SASEL1             : 1;
    unsigned SCSEL0             : 1;
    unsigned SCSEL1             : 1;
    unsigned SBSEL0             : 1;
    unsigned SBSEL1             : 1;
    unsigned SDSEL0             : 1;
    unsigned SDSEL1             : 1;
    };

  struct
    {
    unsigned GASEL              : 2;
    unsigned                    : 6;
    };

  struct
    {
    unsigned SASEL              : 2;
    unsigned                    : 6;
    };

  struct
    {
    unsigned                    : 2;
    unsigned GCSEL              : 2;
    unsigned                    : 4;
    };

  struct
    {
    unsigned                    : 2;
    unsigned SCSEL              : 2;
    unsigned                    : 4;
    };

  struct
    {
    unsigned                    : 4;
    unsigned SBSEL              : 2;
    unsigned                    : 2;
    };

  struct
    {
    unsigned                    : 4;
    unsigned GBSEL              : 2;
    unsigned                    : 2;
    };

  struct
    {
    unsigned                    : 6;
    unsigned SDSEL              : 2;
    };

  struct
    {
    unsigned                    : 6;
    unsigned GDSEL              : 2;
    };
  } __ADCHSbits_t;

extern __at(0x0F99) volatile __ADCHSbits_t ADCHSbits;

#define _GASEL0                 0x01
#define _SASEL0                 0x01
#define _GASEL1                 0x02
#define _SASEL1                 0x02
#define _GCSEL0                 0x04
#define _SCSEL0                 0x04
#define _GCSEL1                 0x08
#define _SCSEL1                 0x08
#define _GBSEL0                 0x10
#define _SBSEL0                 0x10
#define _GBSEL1                 0x20
#define _SBSEL1                 0x20
#define _GDSEL0                 0x40
#define _SDSEL0                 0x40
#define _GDSEL1                 0x80
#define _SDSEL1                 0x80

//==============================================================================


//==============================================================================
//        ADCON3 Bits

extern __at(0x0F9A) __sfr ADCON3;

typedef union
  {
  struct
    {
    unsigned SSRC0              : 1;
    unsigned SSRC1              : 1;
    unsigned SSRC2              : 1;
    unsigned SSRC3              : 1;
    unsigned SSRC4              : 1;
    unsigned                    : 1;
    unsigned ADRS0              : 1;
    unsigned ADRS1              : 1;
    };

  struct
    {
    unsigned SSRC               : 5;
    unsigned                    : 3;
    };

  struct
    {
    unsigned                    : 6;
    unsigned ADRS               : 2;
    };
  } __ADCON3bits_t;

extern __at(0x0F9A) volatile __ADCON3bits_t ADCON3bits;

#define _SSRC0                  0x01
#define _SSRC1                  0x02
#define _SSRC2                  0x04
#define _SSRC3                  0x08
#define _SSRC4                  0x10
#define _ADRS0                  0x40
#define _ADRS1                  0x80

//==============================================================================


//==============================================================================
//        OSCTUNE Bits

extern __at(0x0F9B) __sfr OSCTUNE;

typedef union
  {
  struct
    {
    unsigned TUN0               : 1;
    unsigned TUN1               : 1;
    unsigned TUN2               : 1;
    unsigned TUN3               : 1;
    unsigned TUN4               : 1;
    unsigned TUN5               : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned TUN                : 6;
    unsigned                    : 2;
    };
  } __OSCTUNEbits_t;

extern __at(0x0F9B) volatile __OSCTUNEbits_t OSCTUNEbits;

#define _TUN0                   0x01
#define _TUN1                   0x02
#define _TUN2                   0x04
#define _TUN3                   0x08
#define _TUN4                   0x10
#define _TUN5                   0x20

//==============================================================================


//==============================================================================
//        PIE1 Bits

